gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_SECURITY.c
						i+=3;
						UARTCtrl->TxByte=i;
						i-=2;
						p8tx[1]=i;
						p8tx[2]=i>>8;
						Uart_698_HCSFCS(p8tx);//整帧校验计算(HCS和FCS),同时加结束0x16;返回0=正确，1=错误
						return;
					}
					break;
				default:
					break;
			}
			break;
		default:
			break;
	}
//异常错误返回
//68 29 00 C3 05 LEN_SA 10 8D 40 (LEN_SA+8)
//90	安全响应   		[144]	SECURITY-Response
//02	异常错误           [2]  DAR
//DAR
//A1 88 16 
	MR((u32)p8tx,(u32)p8rx,LEN_SA+8);//复制接收头
	p8tx[3]|=0x80;
	i=LEN_SA+8;
	p8tx[i]=144;//安全响应   		[144]	SECURITY-Response
	p8tx[i+1]=2;//异常错误           [2]  DAR
	p8tx[i+2]=UARTCtrl->DAR;
	i+=3;
	
	i+=3;
	UARTCtrl->TxByte=i;
	i-=2;
	p8tx[1]=i;
	p8tx[2]=i>>8;
	Uart_698_HCSFCS(p8tx);//整帧校验计算(HCS和FCS),同时加结束0x16;返回0=正确，1=错误
	UARTCtrl->Task=2;
	
#if LOG_698==1//0=没,1=有
	LOG(698,1,PORTn,(u8 *)Get_ADDR_UARTnTx(PORTn),UARTCtrl->TxByte,0);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
#endif
}



//安全响应的数据类型（SECURITY-Response）
//SECURITY-Response∷=SEQUENCE
//{
//应用数据单元  CHOICE
//{
//明文应用数据单元   [0]  octet-string，
//密文应用数据单元   [1]  octet-string，
//异常错误           [2]  DAR
//}，
//数据验证信息  CHOICE   OPTIONAL
//{
//数据MAC         [0]  MAC
//}
//}
void SECURITY_Response(u32 PORTn)//安全响应
{
	u32 i;
	u32 LEN_SA;//服务器地址SA的长度
	u32 LENmax_TxSPACE;//最大还可发送的字节数
//	UARTCtrl_TypeDef * UARTCtrl;
	u8 * p8rx;
//	u8 * p8tx;
	u32 LEN_TypeByte1;
	u32 LEN_Data1;
//	u32 LEN_TypeByte2;
//	u32 LEN_Data2;
//	u32 DI;
//	u8 *p8esamrx;
//	ms_Type *ms;
	ClientConnectInfo_TypeDef *ClientConnectInfo;//客户机连接信息
	
//	p8esamrx=(u8 *)(ADDR_UART7Rx);
//	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	LENmax_TxSPACE=Get_LEN_UARTnTx(PORTn);//最大还可发送的字节数
	LENmax_TxSPACE-=TxAPDUOffset+1;//1byte上报信息FollowReport OPTIONAL=0 表示没有
#if USE_ClientConnectInfo==0//使用客户机连接信息的客户机最大接收字节:0=不使用,1=使用
	ClientConnectInfo=ClientConnectInfo;
#else
	//客户机接收缓冲长度
	ClientConnectInfo=(ClientConnectInfo_TypeDef*)UARTCtrl->ConnectInfo;//客户机连接信息
	i=ClientConnectInfo->LEN_Rx;
	i=R_Inverse(i,2);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
	if(i<2048)
	{
		i=2048;
	}
	if(i>(TxAPDUOffset+1))
	{//不为0
		i-=(TxAPDUOffset+1);
		if(LENmax_TxSPACE>i)
		{
			LENmax_TxSPACE=i;
		}
	}
#endif
	p8rx=(u8 *)Get_ADDR_UARTnRx(PORTn);
//	p8tx=(u8 *)Get_ADDR_UARTnTx(PORTn);

	LEN_SA=p8rx[4];//取地址字节数
	LEN_SA&=0x0f;
	LEN_SA++;
	
	i=p8rx[LEN_SA+8+1];
	LEN_TypeByte1=Get_DL698ByteTypeLenByte(p8rx+LEN_SA+8+2);//得到DL698字节类型用来表示长度单元的字节数
	LEN_Data1=Get_DL698ByteTypeLenValue(p8rx+LEN_SA+8+2);//得到DL698字节类型用来表示长度单元的字节数
	switch(i)
	{
		case 0://明文应用数据单元   [0]  octet-string
//68 2c 00 03 05 01 00 00 00 00 00 00 12 d1 
//90 00 13 08 02 01 01 31 01 02 00 01 07 e2 08 01 09 2e 27 00 00 0a 01 
//00 04 a3 64 42 c4 
//e6 f4 16
			//组接收帧
			MR((u32)p8rx+LEN_SA+8,(u32)p8rx+LEN_SA+8+2+LEN_TypeByte1,LEN_Data1);
			//修改接收帧长度域
			i=LEN_SA+8+LEN_Data1+3;
			i-=2;//除起始字符和结束字符之外的帧字节数
			p8rx[1]=i;
			p8rx[2]=i>>8;
			Uart_698_Data(PORTn,0);//UART_698数据;入口:安全模式SECURITY=0不启用=1启用
			break;
		case 1://密文应用数据单元   [1]  octet-string，
			
			break;
		case 2://异常错误           [2]  DAR
			break;
	}
}








